In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
visa_df=pd.read_csv(r'C:\Users\HP\Documents\NARESHIT\visadataset.csv')

In [7]:
bank_df=pd.read_csv(r'C:\Users\HP\Documents\NARESHIT\Python sessions\bank.csv',
                    sep=';')

- shape 

- size

- len

- columns

- dtypes

- isnull

- info

In [11]:
visa_df.shape

(25480, 12)

In [13]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [15]:
type(visa_df)

pandas.core.frame.DataFrame

In [22]:
bank_df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [17]:
type(visa_df.dtypes)

pandas.core.series.Series

- Series looks like dataframe

- Dataframe has column names matrix kind

- Series only index and its value

- Series like a dictionary key and values

In [19]:
visa_df.dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [23]:
visa_df.dtypes.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'),
       dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'),
       dtype('O'), dtype('O'), dtype('O')], dtype=object)

In [25]:
list(visa_df.dtypes.items())

[('case_id', dtype('O')),
 ('continent', dtype('O')),
 ('education_of_employee', dtype('O')),
 ('has_job_experience', dtype('O')),
 ('requires_job_training', dtype('O')),
 ('no_of_employees', dtype('int64')),
 ('yr_of_estab', dtype('int64')),
 ('region_of_employment', dtype('O')),
 ('prevailing_wage', dtype('float64')),
 ('unit_of_wage', dtype('O')),
 ('full_time_position', dtype('O')),
 ('case_status', dtype('O'))]

**Make a Dataframe**

In [27]:
pd.DataFrame(visa_df.dtypes)

                             0
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [29]:
keys=visa_df.dtypes.keys()
values=visa_df.dtypes.values
pd.DataFrame(zip(keys,values),
            columns=['Column name','Data type'])

              Column name Data type
0                 case_id    object
1               continent    object
2   education_of_employee    object
3      has_job_experience    object
4   requires_job_training    object
5         no_of_employees     int64
6             yr_of_estab     int64
7    region_of_employment    object
8         prevailing_wage   float64
9            unit_of_wage    object
10     full_time_position    object
11            case_status    object

- When we have a dictionary 

- First makes in to keys and values separate

- Then create a dataframe

**Task-1: Separate categorical columns and numerical columns**

In [31]:
dict1={'A':1,
      'B':2,
      'a':3,
      'b':4}
for i,j in dict1.items():
    #print(i,j)
    if i.isupper():
        print(j)

1
2

In [84]:
dtypes=dict(visa_df.dtypes)
cat,num=[],[]
for i,j in dtypes.items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)

In [33]:
dict(visa_df.dtypes)
# iterate two i,j
# apply the condition
# if j=='object'
# append i in a list
# else
#  append i in list

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [35]:
dtypes=dict(visa_df.dtypes)
cat,num=[],[]
for i,j in dtypes.items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)

In [37]:
dtypes=dict(visa_df.dtypes)
cat=[i for i,j in dtypes.items() if j=='object']
num=[i for i,j in dtypes.items() if j!='object']

**Select_dtypes**

In [39]:
cat=visa_df.select_dtypes(include='object').columns

In [41]:
num=visa_df.select_dtypes(exclude='object').columns

- Import the packages

- Read the data

- Selectedtypes

**Data selection**

- take

- loc

- iloc

In [43]:
# select 100,200,300 rows data
rows=[100,200,300]
visa_df.take(rows,axis=0)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [45]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [47]:
cols=[1,5]
visa_df.take(cols,axis=1).take(rows,axis=0)

    continent  no_of_employees
100      Asia             2227
200      Asia             3282
300      Asia             3268

- Manual counting index of columns 

- At a time i can not select rows and columns we need to do two takes

**iloc**

iloc[rows,columns]

iloc[start:stop:step,start:stop:step]

In [49]:
visa_df.iloc[1:5,2:5]

  education_of_employee has_job_experience requires_job_training
1              Master's                  Y                     N
2            Bachelor's                  N                     Y
3            Bachelor's                  N                     N
4              Master's                  Y                     N

In [51]:
visa_df.iloc[1:5,5] # w
visa_df.iloc[4,2:5] # w
visa_df.iloc[1:5,[2,6,7]] # w
visa_df.iloc[[100,200,300],2:5] # w
visa_df.iloc[[100,200,300],[2,6,7]] # w
visa_df.iloc[100,5] # w
visa_df.iloc[100] # w
visa_df.iloc[:,5] # w
visa_df.iloc[5,:] # w

case_id                     EZYV06
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2339
yr_of_estab                   2012
region_of_employment         South
prevailing_wage           78252.14
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 5, dtype: object

In [53]:
visa_df.iloc[4,2:5]

education_of_employee    Master's
has_job_experience              Y
requires_job_training           N
Name: 4, dtype: object

In [55]:
visa_df.iloc[1:5,[2,6,7]]

  education_of_employee  yr_of_estab region_of_employment
1              Master's         2002            Northeast
2            Bachelor's         2008                 West
3            Bachelor's         1897                 West
4              Master's         2005                South

In [57]:
visa_df.iloc[[100,200,300],2:5]

    education_of_employee has_job_experience requires_job_training
100              Master's                  Y                     N
200             Doctorate                  Y                     N
300              Master's                  Y                     N

In [59]:
visa_df.iloc[[100,200,300],[2,6,7]]

    education_of_employee  yr_of_estab region_of_employment
100              Master's         2007            Northeast
200             Doctorate         1979                 West
300              Master's         2012              Midwest

In [61]:
visa_df.iloc[100]

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [63]:
visa_df.iloc[:,5]

0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64

In [65]:
# Selecting a particular columns

visa_df.iloc[5,:]

case_id                     EZYV06
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2339
yr_of_estab                   2012
region_of_employment         South
prevailing_wage           78252.14
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 5, dtype: object

In [67]:
visa_df.iloc[:,[5]]

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

In [69]:
visa_df.iloc[:,5]  # series
visa_df.iloc[:,[5]] # df

       no_of_employees
0                14513
1                 2412
2                44444
3                   98
4                 1082
...                ...
25475             2601
25476             3274
25477             1121
25478             1918
25479             3195

[25480 rows x 1 columns]

In [73]:
visa_df.loc[:,'no_of_employees']

0        14513
1         2412
2        44444
3           98
4         1082
         ...
25475     2601
25476     3274
25477     1121
25478     1918
25479     3195
Name: no_of_employees, Length: 25480, dtype: int64

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

visa_df=pd.read_csv(r'C:\Users\HP\Documents\NARESHIT\visadataset.csv')

cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [31]:
cat

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

**How to select the columns data**

In [84]:
visa_df.iloc[:,1]
visa_df.iloc[:,[1]]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [86]:
visa_df.loc[:,'continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [88]:
visa_df.loc[:,['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [90]:
visa_df['continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [92]:
visa_df[['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [ ]:
visa_df.iloc[:,1]   # Series
visa_df.iloc[:,[1]]   # Dataframe
visa_df.loc[:,'continent']    # Series
visa_df.loc[:,['continent']]    # Dataframe
visa_df['continent']        # Series
visa_df[['continent']]       # Dataframe

In [100]:
#visa_df['continent','case_status']        # Works
visa_df[['continent','case_status']]      # Fail

      continent case_status
0          Asia      Denied
1          Asia   Certified
2          Asia      Denied
3          Asia      Denied
4        Africa   Certified
...         ...         ...
25475      Asia   Certified
25476      Asia   Certified
25477      Asia   Certified
25478      Asia   Certified
25479      Asia   Certified

[25480 rows x 2 columns]